artillery-config.yml
# Artillery Load Testing Configuration
config:
  target: "http://localhost:3000"
  plugins:
    expect: {}
    metrics-by-endpoint: {}
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 300
      arrivalRate: 20
      rampTo: 50
      name: "Load test"
    - duration: 60
      arrivalRate: 50
      name: "Sustained load"
  payload:
    path: "test-data/payload.csv"
    fields:
      - "email"
      - "password"
  processor: "test-functions.js"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Public: Health & Analytics"
    weight: 20
    flow:
      - get:
          url: "/api/health"
          expect:
            - statusCode: 200
      - get:
          url: "/api/health/ready"
          expect:
            - statusCode: 200
      - post:
          url: "/api/search"
          json:
            query: "blockchain"
          expect:
            - statusCode: 200

  - name: "User: Auth Flow"
    weight: 30
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.data.accessToken"
              as: "token"
          expect:
            - statusCode: 200
      - get:
          url: "/api/profiles/me"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200
      - get:
          url: "/api/profiles/me/full"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200

  - name: "User: Course Exploration"
    weight: 30
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.data.accessToken"
              as: "token"
      - get:
          url: "/api/courses?page=1&limit=10"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200
      - post:
          url: "/api/search"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            query: "smart contracts"
          expect:
            - statusCode: 200

  - name: "User: Profile & Portfolio"
    weight: 20
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.data.accessToken"
              as: "token"
      - get:
          url: "/api/profiles/me/portfolio"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200
      - get:
          url: "/api/profiles/me/badges"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200