artillery-stress.yml
# Artillery Stress Testing Configuration
config:
  target: "http://localhost:3000"
  plugins:
    expect: {}
    metrics-by-endpoint: {}
  phases:
    - duration: 30
      arrivalRate: 50
      name: "Warm up"
    - duration: 60
      arrivalRate: 100
      rampTo: 500
      name: "Spike test"
    - duration: 60
      arrivalRate: 500
      name: "Stress test peak"
  payload:
    path: "test-data/payload.csv"
    fields:
      - "email"
      - "password"
  processor: "test-functions.js"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Intense Search & Auth"
    weight: 50
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.data.accessToken"
              as: "token"
          expect:
            - statusCode: 200
      - post:
          url: "/api/search"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            query: "blockchain stress test"
          expect:
            - statusCode: 200

  - name: "Health Check Flood"
    weight: 50
    flow:
      - get:
          url: "/api/health"
          expect:
            - statusCode: 200
      - get:
          url: "/api/health/ready"
          expect:
            - statusCode: 200